Tekla.Structures.Model.CoordinateSystemExtensions
The Tekla.Structures.Model.CoordinateSystemExtensions class provides a set of extension methods for converting geometric values between different coordinate systems.

Tekla.Structures.Model.CoordinateSystemExtensions.ToGlobal(Tekla.Common.Geometry.Vector3,Tekla.Structures.Geometry3d.CoordinateSystem)
Transforms the given point, having local coordinates, to a Tekla.Common.Geometry.Vector3 in global coordinates.
point: The Tekla.Common.Geometry.Vector3, in local coordinates, to convert.
pointLocalCoordinateSystem: The local Tekla.Structures.Geometry3d.CoordinateSystem of the point, or null to indicate the currently active local coordinate system.
Returns: A Tekla.Common.Geometry.Vector3 in global coordinates, matching the local point value.

Tekla.Structures.Model.CoordinateSystemExtensions.ToGlobal(Tekla.Common.Geometry.Vector3,Tekla.BIM.Geometry.CoordinateSystem3)
Transforms the given point, having local coordinates, to a Tekla.Common.Geometry.Vector3 in global coordinates.
point: The Tekla.Common.Geometry.Vector3, in local coordinates, to convert.
pointLocalCoordinateSystem: The local Tekla.BIM.Geometry.CoordinateSystem3 of the point.
Returns: A Tekla.Common.Geometry.Vector3 in global coordinates, matching the local point value.

Tekla.Structures.Model.CoordinateSystemExtensions.ToLocal(Tekla.Common.Geometry.Vector3,Tekla.Structures.Geometry3d.CoordinateSystem)
Transforms the given point, having global coordinates, to a Tekla.Common.Geometry.Vector3 in local coordinates.
point: The Tekla.Common.Geometry.Vector3, in global coordinates, to convert.
targetLocalCoordinateSystem: The expected local Tekla.Structures.Geometry3d.CoordinateSystem of the returned Tekla.Common.Geometry.Vector3, or null to indicate the currently active local coordinate system.
Returns: A Tekla.Common.Geometry.Vector3 in local coordinates, matching the global point value.

Tekla.Structures.Model.CoordinateSystemExtensions.ToLocal(Tekla.Common.Geometry.Vector3,Tekla.BIM.Geometry.CoordinateSystem3)
Transforms the given point, having global coordinates, to a Tekla.Common.Geometry.Vector3 in local coordinates.
point: The Tekla.Common.Geometry.Vector3, in global coordinates, to convert.
targetLocalCoordinateSystem: The expected local Tekla.BIM.Geometry.CoordinateSystem3 of the returned Tekla.Common.Geometry.Vector3.
Returns: A Tekla.Common.Geometry.Vector3 in local coordinates, matching the global point value.

Tekla.Structures.Model.CoordinateSystemExtensions.ToGlobal(Tekla.Common.Geometry.Segment3,Tekla.Structures.Geometry3d.CoordinateSystem)
Transforms the given segment, having local coordinates, to a Tekla.Common.Geometry.Segment3 in global coordinates.
segment: The Tekla.Common.Geometry.Segment3, in local coordinates, to convert.
pointLocalCoordinateSystem: The local Tekla.Structures.Geometry3d.CoordinateSystem of the segment, or null to indicate the currently active local coordinate system.
Returns: A Tekla.Common.Geometry.Segment3 in global coordinates, matching the local segment value.

Tekla.Structures.Model.CoordinateSystemExtensions.ToGlobal(Tekla.Common.Geometry.Segment3,Tekla.BIM.Geometry.CoordinateSystem3)
Transforms the given segment, having local coordinates, to a Tekla.Common.Geometry.Segment3 in global coordinates.
segment: The Tekla.Common.Geometry.Segment3, in local coordinates, to convert.
pointLocalCoordinateSystem: The local Tekla.BIM.Geometry.CoordinateSystem3 of the segment.
Returns: A Tekla.Common.Geometry.Segment3 in global coordinates, matching the local segment value.

Tekla.Structures.Model.CoordinateSystemExtensions.ToLocal(Tekla.Common.Geometry.Segment3,Tekla.Structures.Geometry3d.CoordinateSystem)
Transforms the given segment, having global coordinates, to a Tekla.Common.Geometry.Segment3 in local coordinates.
segment: The Tekla.Common.Geometry.Segment3, in global coordinates, to convert.
targetLocalCoordinateSystem: The expected local Tekla.Structures.Geometry3d.CoordinateSystem of the returned Tekla.Common.Geometry.Segment3, or null to indicate the currently active local coordinate system.
Returns: A Tekla.Common.Geometry.Segment3 in local coordinates, matching the global segment value.

Tekla.Structures.Model.CoordinateSystemExtensions.ToLocal(Tekla.Common.Geometry.Segment3,Tekla.BIM.Geometry.CoordinateSystem3)
Transforms the given segment, having global coordinates, to a Tekla.Common.Geometry.Segment3 in local coordinates.
segment: The Tekla.Common.Geometry.Segment3, in global coordinates, to convert.
targetLocalCoordinateSystem: The expected local Tekla.BIM.Geometry.CoordinateSystem3 of the returned Tekla.Common.Geometry.Segment3.
Returns: A Tekla.Common.Geometry.Segment3 in local coordinates, matching the global segment value.

Tekla.Structures.Model.CoordinateSystemExtensions.GetLocalToGlobalMatrix
Gets the transformation Tekla.Structures.Geometry3d.Matrix to convert values from local to global coordinates.
Returns: The transformation Tekla.Structures.Geometry3d.Matrix to convert values from local to global coordinates.

Tekla.Structures.Model.CoordinateSystemExtensions.GetGlobalToLocalMatrix
Gets the transformation Tekla.Structures.Geometry3d.Matrix to convert values from global to local coordinates.
Returns: The transformation Tekla.Structures.Geometry3d.Matrix to convert values from global to local coordinates.